Revit 2027 API
ConceptualConstructionType.GetAllConceptualConstructionsForCategory Method
 Get all the ids of constructions applicable to the input massSubCategory
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ICollection<ElementId> GetAllConceptualConstructionsForCategory(
	Document ccda,
	ElementId massSubCategoryId
)
Public Shared Function GetAllConceptualConstructionsForCategory (
	ccda As Document,
	massSubCategoryId As ElementId
) As ICollection(Of ElementId)
public:
static ICollection<ElementId^>^ GetAllConceptualConstructionsForCategory(
	Document^ ccda,
	ElementId^ massSubCategoryId
)
static member GetAllConceptualConstructionsForCategory :
        ccda : Document *
        massSubCategoryId : ElementId -> ICollection<ElementId>
Parameters
ccda Document
 The document.
massSubCategoryId ElementId
 The ElementId of the mass subcategory.
Return Value
ICollection<ElementId>
 Returns a set of ElementIds that for the ConceptualConstructionTypes that are appropriate for the subcategory.
Exceptions
Exception | Condition
ArgumentException |  The mass sub-category is none of the OST_MassInteriorWall, OST_MassExteriorWall, OST_MassExteriorWallUnderground, OST_MassWallsAll, OST_MassRoof, OST_MassFloor, OST_MassSlab, OST_MassFloorsAll, OST_MassShade, OST_MassGlazing, OST_MassSkylights, OST_MassGlazingAll or OST_MassOpening.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ConceptualConstructionType Class
Autodesk.Revit.DB.Analysis Namespace